{
  "_name_or_path": "microsoft/swin-tiny-patch4-window7-224",
  "architectures": [
    "SwinForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "depths": [
    2,
    2,
    6,
    2
  ],
  "drop_path_rate": 0.1,
  "embed_dim": 96,
  "encoder_stride": 32,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Pepper__bell___Bacterial_spot",
    "1": "Pepper__bell___healthy",
    "2": "Potato___Early_blight",
    "3": "Potato___Late_blight",
    "4": "Potato___healthy",
    "5": "Tomato_Bacterial_spot",
    "6": "Tomato_Early_blight",
    "7": "Tomato_Late_blight",
    "8": "Tomato_Leaf_Mold",
    "9": "Tomato_Septoria_leaf_spot",
    "10": "Tomato_Spider_mites_Two_spotted_spider_mite",
    "11": "Tomato__Target_Spot",
    "12": "Tomato__Tomato_YellowLeaf__Curl_Virus",
    "13": "Tomato__Tomato_mosaic_virus",
    "14": "Tomato_healthy"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "Pepper__bell___Bacterial_spot": 0,
    "Pepper__bell___healthy": 1,
    "Potato___Early_blight": 2,
    "Potato___Late_blight": 3,
    "Potato___healthy": 4,
    "Tomato_Bacterial_spot": 5,
    "Tomato_Early_blight": 6,
    "Tomato_Late_blight": 7,
    "Tomato_Leaf_Mold": 8,
    "Tomato_Septoria_leaf_spot": 9,
    "Tomato_Spider_mites_Two_spotted_spider_mite": 10,
    "Tomato__Target_Spot": 11,
    "Tomato__Tomato_YellowLeaf__Curl_Virus": 12,
    "Tomato__Tomato_mosaic_virus": 13,
    "Tomato_healthy": 14
  },
  "layer_norm_eps": 1e-05,
  "mlp_ratio": 4.0,
  "model_type": "swin",
  "num_channels": 3,
  "num_heads": [
    3,
    6,
    12,
    24
  ],
  "num_layers": 4,
  "patch_size": 4,
  "path_norm": true,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.20.1",
  "use_absolute_embeddings": false,
  "window_size": 7
}
