{
  "_name_or_path": "microsoft/resnet-50",
  "architectures": [
    "ResNetForImageClassification"
  ],
  "depths": [
    3,
    4,
    6,
    3
  ],
  "downsample_in_bottleneck": false,
  "downsample_in_first_stage": false,
  "embedding_size": 64,
  "hidden_act": "relu",
  "hidden_sizes": [
    256,
    512,
    1024,
    2048
  ],
  "id2label": {
    "0": "Apple Apple scab",
    "1": "Apple Black rot",
    "2": "Apple Cedar apple rust",
    "3": "Apple healthy",
    "4": "Blueberry healthy",
    "5": "Cherry (including sour) Powdery mildew",
    "6": "Cherry (including sour) healthy",
    "7": "Corn (maize) Cercospora leaf spot Gray leaf spot",
    "8": "Corn (maize) Common rust ",
    "9": "Corn (maize) Northern Leaf Blight",
    "10": "Corn (maize) healthy",
    "11": "Grape Black rot",
    "12": "Grape Esca (Black Measles)",
    "13": "Grape Leaf blight (Isariopsis Leaf Spot)",
    "14": "Grape healthy",
    "15": "Orange Haunglongbing (Citrus greening)",
    "16": "Peach Bacterial spot",
    "17": "Peach healthy",
    "18": "Pepper, bell Bacterial spot",
    "19": "Pepper, bell healthy",
    "20": "Potato Early blight",
    "21": "Potato Late blight",
    "22": "Potato healthy",
    "23": "Raspberry healthy",
    "24": "Soybean healthy",
    "25": "Squash Powdery mildew",
    "26": "Strawberry Leaf scorch",
    "27": "Strawberry healthy",
    "28": "Tomato Bacterial spot",
    "29": "Tomato Early blight",
    "30": "Tomato Late blight",
    "31": "Tomato Leaf Mold",
    "32": "Tomato Septoria leaf spot",
    "33": "Tomato Spider mites Two-spotted spider mite",
    "34": "Tomato Target Spot",
    "35": "Tomato Tomato Yellow Leaf Curl Virus",
    "36": "Tomato Tomato mosaic virus",
    "37": "Tomato healthy"
  },
  "label2id": {
    "Apple Apple scab": 0,
    "Apple Black rot": 1,
    "Apple Cedar apple rust": 2,
    "Apple healthy": 3,
    "Blueberry healthy": 4,
    "Cherry (including sour) Powdery mildew": 5,
    "Cherry (including sour) healthy": 6,
    "Corn (maize) Cercospora leaf spot Gray leaf spot": 7,
    "Corn (maize) Common rust ": 8,
    "Corn (maize) Northern Leaf Blight": 9,
    "Corn (maize) healthy": 10,
    "Grape Black rot": 11,
    "Grape Esca (Black Measles)": 12,
    "Grape Leaf blight (Isariopsis Leaf Spot)": 13,
    "Grape healthy": 14,
    "Orange Haunglongbing (Citrus greening)": 15,
    "Peach Bacterial spot": 16,
    "Peach healthy": 17,
    "Pepper, bell Bacterial spot": 18,
    "Pepper, bell healthy": 19,
    "Potato Early blight": 20,
    "Potato Late blight": 21,
    "Potato healthy": 22,
    "Raspberry healthy": 23,
    "Soybean healthy": 24,
    "Squash Powdery mildew": 25,
    "Strawberry Leaf scorch": 26,
    "Strawberry healthy": 27,
    "Tomato Bacterial spot": 28,
    "Tomato Early blight": 29,
    "Tomato Late blight": 30,
    "Tomato Leaf Mold": 31,
    "Tomato Septoria leaf spot": 32,
    "Tomato Spider mites Two-spotted spider mite": 33,
    "Tomato Target Spot": 34,
    "Tomato Tomato Yellow Leaf Curl Virus": 35,
    "Tomato Tomato mosaic virus": 36,
    "Tomato healthy": 37
  },
  "layer_type": "bottleneck",
  "model_type": "resnet",
  "num_channels": 3,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.35.2"
}
